{
  "<|pad|>": 0,
  "<|bos|>": 1,
  "<|eos|>": 2,
  "<|fix|>": 3,
  "<|field|>": 4,
  "<|eom|>": 5,
  "<|unk|>": 6,
  "\n": 7,
  " ": 8,
  "!": 9,
  "\"": 10,
  "#": 11,
  "$": 12,
  "%": 13,
  "&": 14,
  "'": 15,
  "(": 16,
  ")": 17,
  "*": 18,
  "+": 19,
  ",": 20,
  "-": 21,
  ".": 22,
  "/": 23,
  "0": 24,
  "1": 25,
  "2": 26,
  "3": 27,
  "4": 28,
  "5": 29,
  "6": 30,
  "7": 31,
  "8": 32,
  "9": 33,
  ":": 34,
  "=": 35,
  ">": 36,
  "?": 37,
  "@": 38,
  "A": 39,
  "B": 40,
  "C": 41,
  "D": 42,
  "E": 43,
  "F": 44,
  "G": 45,
  "H": 46,
  "I": 47,
  "J": 48,
  "K": 49,
  "L": 50,
  "M": 51,
  "N": 52,
  "O": 53,
  "P": 54,
  "Q": 55,
  "R": 56,
  "S": 57,
  "T": 58,
  "U": 59,
  "V": 60,
  "W": 61,
  "X": 62,
  "Y": 63,
  "Z": 64,
  "[": 65,
  "]": 66,
  "a": 67,
  "b": 68,
  "c": 69,
  "d": 70,
  "e": 71,
  "f": 72,
  "g": 73,
  "h": 74,
  "i": 75,
  "j": 76,
  "k": 77,
  "l": 78,
  "m": 79,
  "n": 80,
  "o": 81,
  "p": 82,
  "q": 83,
  "r": 84,
  "s": 85,
  "t": 86,
  "u": 87,
  "v": 88,
  "w": 89,
  "x": 90,
  "y": 91,
  "z": 92,
  "|": 93,
  "\u00b7": 94,
  "\u00d3": 95,
  "\u00e0": 96,
  "\u00e4": 97,
  "\u00e9": 98,
  "\u00f3": 99,
  "\u00f6": 100,
  "\u00fc": 101,
  "\u0131": 102,
  "\u0142": 103,
  "\u0144": 104,
  "\u015e": 105,
  "\u0307": 106,
  "\u2013": 107,
  "\u2014": 108,
  "\u201c": 109,
  "\u201d": 110,
  "8=FIX": 111,
  "8=": 112,
  "9=": 113,
  "35=": 114,
  "49=": 115,
  "56=": 116,
  "34=": 117,
  "52=": 118,
  "11=": 119,
  "21=": 120,
  "55=": 121,
  "54=": 122,
  "38=": 123,
  "40=": 124,
  "44=": 125,
  "59=": 126,
  "150=": 127,
  "151=": 128,
  "14=": 129,
  "6=": 130,
  "10=": 131,
  "37=": 132,
  "17=": 133,
  "39=": 134,
  "60=": 135,
  "41=": 136,
  "1=": 137,
  "15=": 138,
  "48=": 139,
  "22=": 140,
  "31=": 141,
  "32=": 142,
  "58=": 143,
  "98=": 144,
  "108=": 145,
  "262=": 146,
  "263=": 147,
  "264=": 148,
  "269=": 149,
  "270=": 150,
  "271=": 151,
  "1128=": 152,
  "1137=": 153,
  "553=": 154,
  "554=": 155,
  "[FIX-5.0SP2]": 156,
  "Tag": 157,
  "for": 158,
  "to": 159,
  "of": 160,
  "shares": 161,
  "order": 162,
  "buy": 163,
  "sell": 164,
  "at": 165,
  "[Optional]": 166,
  "market": 167,
  "price": 168,
  "limit": 169,
  "want": 170,
  "quantity": 171,
  "with": 172,
  "the": 173,
  "FIX": 174,
  "session": 175,
  "30": 176,
  "Connect": 177,
  "heartbeat": 178,
  "seconds": 179,
  "data": 180,
  "Create": 181,
  "Cancel": 182,
  "Subscribe": 183,
  "my": 184,
  "Place": 185,
  "order:": 186,
  "STRING": 187,
  "Inc.": 188,
  "Buy": 189,
  "trade": 190,
  "Sell": 191,
  "stock": 192,
  "place": 193,
  "short": 194,
  "get": 195,
  "me": 196,
  "purchase": 197,
  "in": 198,
  "NUMINGR": 199,
  "The": 200,
  "is": 201,
  "Ltd.": 202,
  "or": 203,
  "Number": 204,
  "Corp.": 205,
  "be": 206,
  "Corporation": 207,
  "CHAR": 208,
  "Holdings": 209,
  "used": 210,
  "[Required]": 211,
  "Limited": 212,
  "value": 213,
  "INT": 214,
  "ID": 215,
  "Group": 216,
  "Refer": 217,
  "PRICE": 218,
  "an": 219,
  "Energy": 220,
  "instrument's": 221,
  "Indicates": 222,
  "identifier": 223,
  "on": 224,
  "if": 225,
  "definition": 226,
  "International": 227,
  "security's": 228,
  "Resources": 229,
  "Unique": 230,
  "that": 231,
  "message": 232,
  "SEE": 233,
  "which": 234,
  "Used": 235,
  "within": 236,
  "and": 237,
  "Gold": 238,
  "See": 239,
  "QTY": 240,
  "\u201cCOMMON": 241,
  "PARTYROLE": 242,
  "IDENTIFICATION": 243,
  "FOR": 244,
  "by": 245,
  "Identifies": 246,
  "AMT": 247,
  "BOOLEAN": 248,
  "number": 249,
  "this": 250,
  "Identification": 251,
  "Technologies": 252,
  "LENGTH": 253,
  "Deprecated": 254,
  "Assigned": 255,
  "Multileg": 256,
  "Acquisition": 257,
  "Specifies": 258,
  "Co": 259,
  "repeating": 260,
  "(n/a)": 261,
  "Plc": 262,
  "PartyRole": 263,
  "as": 264,
  "N/A": 265,
  "(non-ASCII": 266,
  "individual": 267,
  "DATA": 268,
  "characters)": 269,
  "not": 270,
  "UTCTIME": 271,
  "LOCALMKT": 272,
  "PERCENTAG": 273,
  "Risk": 274,
  "\u201cCommon": 275,
  "date": 276,
  "whether": 277,
  "Underlying": 278,
  "when": 279,
  "Message": 280,
  "underlying": 281,
  "type": 282,
  "amount": 283,
  "Metals": 284,
  "Co.,": 285,
  "Corp": 286,
  "Company": 287,
  "CURRENCY": 288,
  "position": 289,
  "specified": 290,
  "trading": 291,
  "Inc.,": 292,
  "being": 293,
  "Global": 294,
  "should": 295,
  "Order": 296,
  "identify": 297,
  "FIRMS\u201d": 298,
  "Industries": 299,
  "Src": 300,
  "currency": 301,
  "field": 302,
  "security": 303,
  "New": 304,
  "Systems": 305,
  "Firms\u201d": 306,
  "Market": 307,
  "Therapeutics": 308,
  "For": 309,
  "Defines": 310,
  "leg": 311,
  "Solutions": 312,
  "specific": 313,
  "Type": 314,
  "Encoded": 315,
  "representation": 316,
  "associated": 317,
  "Can": 318,
  "Request": 319,
  "Ai": 320,
  "from": 321,
  "will": 322,
  "orders": 323,
  "Financial": 324,
  "PartyID": 325,
  "CDS": 326,
  "Of": 327,
  "message.": 328,
  "Mining": 329,
  "Quantity": 330,
  "settlement": 331,
  "Ltd": 332,
  "Amount": 333,
  "request": 334,
  "Report": 335,
  "Bank": 336,
  "name": 337,
  "Required": 338,
  "encoded": 339,
  "Technology": 340,
  "Total": 341,
  "Currency": 342,
  "was": 343,
  "group": 344,
  "China": 345,
  "time": 346,
  "event": 347,
  "source": 348,
  "PartyIDSource": 349,
  "EXCHANGE": 350,
  "Ag": 351,
  "91500": 352,
  "PRICEOFFSE": 353,
  "FX": 354,
  "American": 355,
  "MONTHYEA": 356,
  "has": 357,
  "Capital": 358,
  "Code": 359,
  "code": 360,
  "Px": 361,
  "Pharmaceuticals": 362,
  "Time": 363,
  "reference": 364,
  "party": 365,
  "Power": 366,
  "Firm": 367,
  "28600": 368,
  "(Execution)": 369,
  "Trade": 370,
  "Byte": 371,
  "length": 372,
  "It": 373,
  "PartySubID": 374,
  "Bancorp": 375,
  "Holding": 376,
  "Fixed": 377,
  "status": 378,
  "S.A.": 379,
  "Status": 380,
  "Security": 381,
  "Relationship": 382,
  "1000": 383,
  "transaction": 384,
  "FIX.4.3": 385,
  "FIX.5.0": 386,
  "quote": 387,
  "National": 388,
  "previous": 389,
  "expressed": 390,
  "execution": 391,
  "are": 392,
  "Rights": 393,
  "Position": 394,
  "If": 395,
  "for)": 396,
  "entries": 397,
  "Health": 398,
  "Data": 399,
  "74800": 400,
  "35400": 401,
  "instrument": 402,
  "points": 403,
  "Pacific": 404,
  "allocation": 405,
  "report": 406,
  "trades": 407,
  "Ab": 408,
  "Oil": 409,
  "Ccy": 410,
  "maturity": 411,
  "entries.": 412,
  "represent": 413,
  "target": 414,
  "been": 415,
  "Reason": 416,
  "assigned": 417,
  "group.": 418,
  "41200": 419,
  "39500": 420,
  "class": 421,
  "via": 422,
  "Name": 423,
  "option": 424,
  "52100": 425,
  "Reference": 426,
  "(e.g.": 427,
  "30500": 428,
  "Identifier": 429,
  "20400": 430,
  "Plus": 431,
  "payment": 432,
  "35000": 433,
  "SEQNUM": 434,
  "1900": 435,
  "49700": 436,
  "specified.": 437,
  "order.": 438,
  "Price": 439,
  "Source": 440,
  "Silver": 441,
  "51200": 442,
  "Mass": 443,
  "Ventures": 444,
  "Qty": 445,
  "Exch": 446,
  "88600": 447,
  "Typ": 448,
  "Clean": 449,
  "2000": 450,
  "CIV": 451,
  "how": 452,
  "11000": 453,
  "provided": 454,
  "Japan": 455,
  "7800": 456,
  "Clearing": 457,
  "Cash": 458,
  "Enterprises": 459,
  "i.e.": 460,
  "Medical": 461,
  "15": 462,
  "Trading": 463,
  "Investment": 464,
  "list": 465,
  "Electric": 466,
  "First": 467,
  "Bid": 468,
  "account": 469,
  "Inc": 470,
  "rejected": 471,
  "F/X": 472,
  "76100": 473,
  "represents": 474,
  "This": 475,
  "reporting": 476,
  "must": 477,
  "18800": 478,
  "10": 479,
  "parties": 480,
  "indicate": 481,
  "set": 482,
  "security.": 483,
  "Entertainment": 484,
  "Media": 485,
  "range": 486,
  "13200": 487,
  "Income": 488,
  "71200": 489,
  "strike": 490,
  "affected": 491,
  "54900": 492,
  "Mines": 493,
  "56300": 494,
  "Class": 495,
  "58800": 496,
  "82700": 497,
  "15000": 498,
  "Nippon": 499,
  "\u201cC\u201d": 500,
  "1243": 501,
  "Services": 502,
  "Blue": 503,
  "Group,": 504,
  "IOI": 505,
  "AltIDSrc": 506,
  "PxUOM": 507,
  "Allows": 508,
  "75100": 509,
  "Quote": 510,
  "e.g.": 511,
  "4000": 512,
  "Horizon": 513,
  "84200": 514,
  "sequence": 515,
  "Ii": 516,
  "3200": 517,
  "45400": 518,
  "Values": 519,
  "21": 520,
  "MULTIPLEC": 521,
  "one": 522,
  "interest": 523,
  "47200": 524,
  "76300": 525,
  "Exploration": 526,
  "trade.": 527,
  "61400": 528,
  "50200": 529,
  "same": 530,
  "block.": 531,
  "Sciences": 532,
  "Session": 533,
  "Star": 534,
  "12": 535,
  "11500": 536,
  "35800": 537,
  "59600": 538,
  "1800": 539,
  "Describes": 540,
  "calculated": 541,
  "10600": 542,
  "92900": 543,
  "27800": 544,
  "47600": 545,
  "Capture": 546,
  "64100": 547,
  "9400": 548,
  "93700": 549,
  "trigger": 550,
  "action": 551,
  "1500": 552,
  "28700": 553,
  "Resource": 554,
  "Swap.": 555,
  "90200": 556,
  "Public": 557,
  "average": 558,
  "format": 559,
  "56500": 560,
  "Brands": 561,
  "Side": 562,
  "29900": 563,
  "7700": 564,
  "64500": 565,
  "33100": 566,
  "12100": 567,
  "ACCOUNTS\u201d": 568,
  "financing": 569,
  "due": 570,
  "List": 571,
  "70600": 572,
  "73400": 573,
  "EXECUTION": 574,
  "SYSTEMS\u201d": 575,
  "Gas": 576,
  "RptID": 577,
  "applicable": 578,
  "62000": 579,
  "85900": 580,
  "spot": 581,
  "rate.": 582,
  "Minerals": 583,
  "365": 584,
  "y)": 585,
  "(Deprecated": 586,
  "Bitcoin": 587,
  "all": 588,
  "processing": 589,
  "single": 590,
  "support": 591,
  "Pct": 592,
  "Settlement": 593,
  "81100": 594,
  "34000": 595,
  "And": 596,
  "Copper": 597,
  "24800": 598,
  "can": 599,
  "45300": 600,
  "USD": 601,
  "9600": 602,
  "Se": 603,
  "Communications": 604,
  "35500": 605,
  "Volume": 606,
  "risk": 607,
  "Education": 608,
  "77000": 609,
  "41300": 610,
  "returned": 611,
  "broker": 612,
  "21200": 613,
  "encrypted": 614,
  "14": 615,
  "30800": 616,
  "100": 617,
  "45500": 618,
  "23": 619,
  "(Provides": 620,
  "ProdCmplx": 621,
  "Must": 622,
  "96800": 623,
  "3000": 624,
  "Token": 625,
  "BIC": 626,
  "original": 627,
  "83100": 628,
  "11": 629,
  "may": 630,
  "Point": 631,
  "85800": 632,
  "49400": 633,
  "34200": 634,
  "63100": 635,
  "96200": 636,
  "method": 637,
  "multileg": 638,
  "66700": 639,
  "ORDER": 640,
  "56100": 641,
  "22100": 642,
  "49600": 643,
  "Management": 644,
  "Rgstry": 645,
  "specifies": 646,
  "Use": 647,
  "1400": 648,
  "forward": 649,
  "e)": 650,
  "Biosciences": 651,
  "Length": 652,
  "entry": 653,
  "84400": 654,
  "51900": 655,
  "85400": 656,
  "52500": 657,
  "53700": 658,
  "Sa": 659,
  "7600": 660,
  "result": 661,
  "N.V": 662,
  "Network": 663,
  "Response": 664,
  "details": 665,
  "15600": 666,
  "Authority": 667,
  "rules": 668,
  "RelatedPartyGrp": 669,
  "Execution": 670,
  "response": 671,
  "identified": 672,
  "Conditionally": 673,
  "required": 674,
  "sent": 675,
  "57100": 676,
  "84700": 677,
  "valid": 678,
  "29300": 679,
  "Application": 680,
  "83300": 681,
  "Air": 682,
  "22500": 683,
  "take": 684,
  "Attribute": 685,
  "credit": 686,
  "Capita": 687,
  "FIRM": 688,
  "complex": 689,
  "given": 690,
  "4200": 691,
  "23400": 692,
  "Stock": 693,
  "21700": 694,
  "1423": 695,
  "34300": 696,
  "To": 697,
  "500": 698,
  "57700": 699,
  "12600": 700,
  "47400": 701,
  "76800": 702,
  "86600": 703,
  "Investments": 704,
  "97300": 705,
  "27500": 706,
  "Alpha": 707,
  "rate": 708,
  "customer": 709,
  "REPLACE": 710,
  "Partially": 711,
  "6000": 712,
  "General": 713,
  "62800": 714,
  "68900": 715,
  "Senior": 716,
  "Living": 717,
  "Ltd.,": 718,
  "28000": 719,
  "Issr": 720,
  "indicator": 721,
  "7900": 722,
  "69600": 723,
  "reported": 724,
  "(or": 725,
  "40200": 726,
  "32500": 727,
  "14800": 728,
  "Finance": 729,
  "(Clearing)": 730,
  "72500": 731,
  "Lake": 732,
  "31500": 733,
  "41600": 734,
  "38800": 735,
  "Foods": 736,
  "79200": 737,
  "1100": 738,
  "70400": 739,
  "26400": 740,
  "64800": 741,
  "89400": 742,
  "offer": 743,
  "Swap": 744,
  "73100": 745,
  "69": 746,
  "Free": 747,
  "23900": 748,
  "24300": 749,
  "using": 750,
  "62": 751,
  "22700": 752,
  "(Status)": 753,
  "REQUEST": 754,
  "(X)": 755,
  "related": 756,
  "event.": 757,
  "59700": 758,
  "68400": 759,
  "reason": 760,
  "20000": 761,
  "16600": 762,
  "Starting": 763,
  "cash": 764,
  "form": 765,
  "200": 766,
  "481": 767,
  "44700": 768,
  "46500": 769,
  "Party": 770,
  "1277": 771,
  "84900": 772,
  "Email": 773,
  "Registration": 774,
  "85700": 775,
  "68700": 776,
  "73": 777,
  "Net": 778,
  "Uranium": 779,
  "Amt": 780,
  "76400": 781,
  "83400": 782,
  "9900": 783,
  "60800": 784,
  "particular": 785,
  "current": 786,
  "Next": 787,
  "Offer": 788,
  "16500": 789,
  "37600": 790,
  "each": 791,
  "distribution": 792,
  "38900": 793,
  "Electronics": 794,
  "46900": 795,
  "Request.": 796,
  "(i.e.": 797,
  "442": 798,
  "exchange": 799,
  "23500": 800,
  "MMY": 801,
  "transfer": 802,
  "1226": 803,
  "TZTIMEO": 804,
  "MatTm": 805,
  "succession": 806,
  "transferred": 807,
  "date.": 808,
  "delivery": 809,
  "express": 810,
  "full": 811,
  "recovery": 812,
  "FIX.4.4": 813,
  "67400": 814,
  "19900": 815,
  "47500": 816,
  "1403": 817,
  "StatReqID": 818,
  "29700": 819,
  "DATE": 820,
  "34900": 821,
  "74000": 822,
  "5600": 823,
  "Corporation,": 824,
  "Lithium": 825,
  "92000": 826,
  "24700": 827,
  "1336": 828,
  "(UnderlyingLegSecurit": 829,
  "ContraBroker": 830,
  "72700": 831,
  "50400": 832,
  "AltID": 833,
  "Treasury": 834,
  "70500": 835,
  "Wellness": 836,
  "74700": 837,
  "94800": 838,
  "364": 839,
  "Password": 840,
  "component.": 841,
  "8200": 842,
  "Account": 843,
  "currently": 844,
  "73700": 845,
  "side": 846,
  "32": 847,
  "groups": 848,
  "84500": 849,
  "36500": 850,
  "31": 851,
  "Pending": 852,
  "8000": 853,
  "out": 854,
  "OptPayAmt": 855,
  "99100": 856,
  "93400": 857,
  "2300": 858,
  "Co.": 859,
  "8900": 860,
  "11800": 861,
  "1259": 862,
  "38200": 863,
  "91700": 864,
  "RelatedContextParties": 865,
  "60": 866,
  "Toho": 867,
  "98300": 868,
  "1282": 869,
  "immediately": 870,
  "precede": 871,
  "it.": 872,
  "65800": 873,
  "card": 874,
  "89300": 875,
  "59300": 876,
  "specify": 877,
  "use": 878,
  "93200": 879,
  "(Bank": 880,
  "Se,": 881,
  "Healthcare": 882,
  "(UnderlyingLegSecurit)": 883,
  "54700": 884,
  "benchmark": 885,
  "32400": 886,
  "83800": 887,
  "26700": 888,
  "87600": 889,
  "34700": 890,
  "90300": 891,
  "Online": 892,
  "49800": 893,
  "63200": 894,
  "registration": 895,
  "commercial": 896,
  "1485": 897,
  "11300": 898,
  "Ending": 899,
  "68500": 900,
  "8700": 901,
  "18300": 902,
  "Optional": 903,
  "Hydrogen": 904,
  "identity": 905,
  "whose": 906,
  "prices": 907,
  "added": 908,
  "Income.": 909,
  "Railway": 910,
  "66000": 911,
  "89600": 912,
  "37100": 913,
  "58600": 914,
  "55100": 915,
  "1401": 916,
  "\"Common": 917,
  "Buyer/Seller,": 918,
  "Custodian,": 919,
  "Tm": 920,
  "446": 921,
  "bid": 922,
  "17": 923,
  "64000": 924,
  "89200": 925,
  "application": 926,
  "15300": 927,
  "34100": 928,
  "97900": 929,
  "75000": 930,
  "Lcl": 931,
  "81300": 932,
  "contain": 933,
  "Leg": 934,
  "lot": 935,
  "69000": 936,
  "13000": 937,
  "Pharma": 938,
  "Aviation": 939,
  "1213": 940,
  "\u201cO\u201d": 941,
  "mass": 942,
  "CANCEL": 943,
  "9100": 944,
  "Sfx": 945,
  "Century": 946,
  "67600": 947,
  "11600": 948,
  "10100": 949,
  "60600": 950,
  "17900": 951,
  "19700": 952,
  "12000": 953,
  "messages": 954,
  "ReqID": 955,
  "676": 956,
  "59500": 957,
  "4300": 958,
  "Instructions": 959,
  "7300": 960,
  "9800": 961,
  "nested": 962,
  "Business": 963,
  "CFI": 964,
  "FLOAT": 965,
  "Allocation": 966,
  "35600": 967,
  "10000": 968,
  "18100": 969,
  "76500": 970,
  "88800": 971,
  "19400": 972,
  "derivatives": 973,
  "28800": 974,
  "after": 975,
  "59": 976,
  "identifying": 977,
  "(Desk)": 978,
  "40": 979,
  "Spread": 980,
  "Asset": 981,
  "contract": 982,
  "5000": 983,
  "23100": 984,
  "23600": 985,
  "21600": 986,
  "part": 987,
  "contrary": 988,
  "\u201cP\u201d": 989,
  "COUNTRY": 990,
  "ISO": 991,
  "Country": 992,
  "Metro": 993,
  "money": 994,
  "Environmental": 995,
  "Water": 996,
  "50900": 997,
  "366": 998,
  "1425": 999,
  "FlexProdElig": 1000,
  "40500": 1001,
  "Xde2Usd": 1002,
  "20900": 1003,
  "581": 1004,
  "130": 1005,
  "SecurityAltIDSource.": 1006,
  "934": 1007,
  "Technologies,": 1008,
  "52000": 1009,
  "45200": 1010,
  "High": 1011,
  "Networks": 1012,
  "Contract": 1013,
  "68": 1014,
  "(Host": 1015,
  "Competent": 1016,
  "CA))": 1017,
  "1309": 1018,
  "most": 1019,
  "liquidity": 1020,
  "SecGrp": 1021,
  "Boyaa": 1022,
  "(Execution": 1023,
  "Reports": 1024,
  "400": 1025,
  "1601": 1026,
  "Type)": 1027,
  "97000": 1028,
  "39300": 1029,
  "78": 1030,
  "Assignment": 1031,
  "667": 1032,
  "56": 1033,
  "899": 1034,
  "margin": 1035,
  "deliver": 1036,
  "27100": 1037,
  "Aircraft": 1038,
  "186": 1039,
  "Wireless": 1040,
  "71600": 1041,
  "MassActionResponse": 1042,
  "Pinnacle": 1043,
  "89500": 1044,
  "In": 1045,
  "America": 1046,
  "34500": 1047,
  "90400": 1048,
  "TimeInForce": 1049,
  "GTD": 1050,
  "168": 1051,
  "461": 1052,
  "Usage": 1053,
  "(3)": 1054,
  "category": 1055,
  "RestrctTyp": 1056,
  "95800": 1057,
  "13900": 1058,
  "529": 1059,
  "more": 1060,
  "98000": 1061,
  "43400": 1062,
  "unit)": 1063,
  "1311": 1064,
  "700": 1065,
  "642": 1066,
  "(Acceptable": 1067,
  "counterparty)": 1068,
  "47": 1069,
  "Series": 1070,
  "Common": 1071,
  "27": 1072,
  "firm": 1073,
  "28": 1074,
  "874": 1075,
  "90700": 1076,
  "CDEFF": 1077,
  "527": 1078,
  "accepts": 1079,
  "book": 1080,
  "UOMQty": 1081,
  "Peer": 1082,
  "25400": 1083,
  "Kawasaki": 1084,
  "Heavy": 1085,
  "then": 1086,
  "46600": 1087,
  "KUMBF": 1088,
  "86500": 1089,
  "Clear": 1090,
  "1217": 1091,
  "SecurityID": 1092,
  "(Contra)": 1093,
  "Solar": 1094,
  "system": 1095,
  "94200": 1096,
  "75": 1097,
  "69100": 1098,
  "Guardforce": 1099,
  "860": 1100,
  "FIX.4.2": 1101,
  "third": 1102,
  "775": 1103,
  "Sol": 1104,
  "1272": 1105,
  "Kainos": 1106,
  "77700": 1107,
  "75800": 1108,
  "72900": 1109,
  "30200": 1110,
  "up)": 1111,
  "540": 1112,
  "August": 1113,
  "37200": 1114,
  "Biosciences,": 1115,
  "LastPx": 1116,
  "38000": 1117,
  "XLO": 1118,
  "Development": 1119,
  "79500": 1120,
  "leg.": 1121,
  "91300": 1122,
  "(UnderlyingSecurityID)": 1123,
  "multiple": 1124,
  "86200": 1125,
  "17300": 1126,
  "84": 1127,
  "SecurityExchange.": 1128,
  "96400": 1129,
  "Exchange": 1130,
  "92700": 1131,
  "Borqs": 1132,
  "Invest": 1133,
  "RelatedPartyAltIDs": 1134,
  "72600": 1135,
  "Growth": 1136,
  "78200": 1137,
  "SYSTEM": 1138,
  "Pit": 1139,
  "Yes": 1140,
  "1506": 1141,
  "1592": 1142,
  "50800": 1143,
  "17800": 1144,
  "Miami": 1145,
  "Counterparty": 1146,
  "Plant": 1147,
  "Veda": 1148,
  "35700": 1149,
  "25600": 1150,
  "Quantum": 1151,
  "56400": 1152,
  "60900": 1153,
  "84800": 1154,
  "119": 1155,
  "822": 1156,
  "\"far": 1157,
  "Amerisafe": 1158,
  "86400": 1159,
  "583": 1160,
  "executions": 1161,
  "other": 1162,
  "text": 1163,
  "handling": 1164,
  "68300": 1165,
  "Adcore": 1166,
  "45100": 1167,
  "54": 1168,
  "TRANSACTION": 1169,
  "53500": 1170,
  "originator)": 1171,
  "658": 1172,
  "16": 1173,
  "32900": 1174,
  "West": 1175,
  "1249": 1176,
  "SecTyp": 1177,
  "48500": 1178,
  "796": 1179,
  "AllocTransType": 1180,
  "Replace": 1181,
  "yield": 1182,
  "Income,": 1183,
  "identifies": 1184,
  "Pool": 1185,
  "1279": 1186,
  "1456": 1187,
  "74600": 1188,
  "248": 1189,
  "CpnPmt": 1190,
  "921": 1191,
  "dirty": 1192,
  "consideration": 1193,
  "deal,": 1194,
  "102": 1195,
  "51800": 1196,
  "2700": 1197,
  "790": 1198,
  "853": 1199,
  "(Uniform": 1200,
  "URL": 1201,
  "993": 1202,
  "CustCpcty": 1203,
  "16000": 1204,
  "50700": 1205,
  "Company,": 1206,
  "31100": 1207,
  "3900": 1208,
  "22": 1209,
  "95100": 1210,
  "734": 1211,
  "Previous": 1212,
  "uerLen)": 1213,
  "EncIssrLen": 1214,
  "Woolworths": 1215,
  "42900": 1216,
  "77600": 1217,
  "745": 1218,
  "Unit": 1219,
  "RUB/UAH": 1220,
  "Plc,": 1221,
  "49300": 1222,
  "24000": 1223,
  "Degrees": 1224,
  "622": 1225,
  "(EncodedLegSecurityD)": 1226,
  "NoSecurityAltID(454)": 1227,
  "763": 1228,
  "64400": 1229,
  "78000": 1230,
  "1190": 1231,
  "636": 1232,
  "48900": 1233,
  "(Cancel)": 1234,
  "REJECT": 1235,
  "Rejected": 1236,
  "49900": 1237,
  "1068": 1238,
  "33900": 1239,
  "Petroleum": 1240,
  "2400": 1241,
  "62700": 1242,
  "Hydro": 1243,
  "Asa": 1244,
  "Game": 1245,
  "Eyes": 1246,
  "42400": 1247,
  "Applied": 1248,
  "Industrial": 1249,
  "61600": 1250,
  "stream": 1251,
  "77900": 1252,
  "151": 1253,
  "open": 1254,
  "1576": 1255,
  "5500": 1256,
  "Sym": 1257,
  "49500": 1258,
  "SecurityID.": 1259,
  "13800": 1260,
  "45700": 1261,
  "Blackstone": 1262,
  "357": 1263,
  "Rules": 1264,
  "55500": 1265,
  "1424": 1266,
  "(UnderlyingPriceUnitO)": 1267,
  "PriceUnitOfMeasure(1191)": 1268,
  "354": 1269,
  "(EncodedTextLen)": 1270,
  "EncUndSecDesc": 1271,
  "SecuritySubType.": 1272,
  "12400": 1273,
  "DisplayQty": 1274,
  "56700": 1275,
  "741": 1276,
  "300": 1277,
  "MULTILEGREPORTINGTYPE": 1278,
  "FIX.4.4)": 1279,
  "Road": 1280,
  "610": 1281,
  "76600": 1282,
  "Service": 1283,
  "summation": 1284,
  "amounts": 1285,
  "Event": 1286,
  "Adjustment": 1287,
  "show": 1288,
  "total": 1289,
  "reduction": 1290,
  "Delivery": 1291,
  "have": 1292,
  "provides": 1293,
  "indication": 1294,
  "curve": 1295,
  "qualifiers": 1296,
  "MDEntryType": 1297,
  "(269)": 1298,
  "up": 1299,
  "259": 1300,
  "service": 1301,
  "STRINGINT": 1302,
  "RepoCollSecTyp": 1303,
  "92300": 1304,
  "Syensqo": 1305,
  "730": 1306,
  "81400": 1307,
  "1572": 1308,
  "(no": 1309,
  "longer": 1310,
  "used))": 1311,
  "187": 1312,
  "93300": 1313,
  "S.A.B.": 1314,
  "De": 1315,
  "Consolidated": 1316,
  "(Received)": 1317,
  "department": 1318,
  "desk": 1319,
  "86000": 1320,
  "6500": 1321,
  "57600": 1322,
  "(DerivativeInstrumentP)": 1323,
  "1493": 1324,
  "33000": 1325,
  "(RelationshipRiskSecur)": 1326,
  "SecSubTyp": 1327,
  "entity": 1328,
  "Vital": 1329,
  "63700": 1330,
  "Harbor": 1331,
  "Right": 1332,
  "(Year)": 1333,
  "184": 1334,
  "99": 1335,
  "STOPPX": 1336,
  "JUVF": 1337,
  "57": 1338,
  "Sompo": 1339,
  "(EncodedUnderlyingSecurityD": 1340,
  "5400": 1341,
  "76900": 1342,
  "Astro": 1343,
  "34600": 1344,
  "39100": 1345,
  "13600": 1346,
  "root": 1347,
  "peg": 1348,
  "static/fixed": 1349,
  "floats": 1350,
  "1124": 1351,
  "(of": 1352,
  "1230": 1353,
  "885": 1354,
  "collateral": 1355,
  "SBINF": 1356,
  "TESTZ": 1357,
  "(see": 1358,
  "product": 1359,
  "29100": 1360,
  "1105": 1361,
  "ce)": 1362,
  "TrgrSecIDSrc": 1363,
  "41": 1364,
  "Accounts\u201d": 1365,
  "20800": 1366,
  "1619": 1367,
  "amount.": 1368,
  "92500": 1369,
  "1280": 1370,
  "(DerivativeEncodedSecurityDe": 1371,
  "scLen)": 1372,
  "Americann": 1373,
  "1200": 1374,
  "911": 1375,
  "55400": 1376,
  "LASTPX": 1377,
  "subsequent": 1378,
  "PENDING": 1379,
  "7000": 1380,
  "Note": 1381,
  "Description": 1382,
  "Desc": 1383,
  "87400": 1384,
  "DDOSF": 1385,
  "(1)": 1386,
  "37900": 1387,
  "Square": 1388,
  "206": 1389,
  "Overactive": 1390,
  "Well": 1391,
  "1225": 1392,
  "indicating": 1393,
  "pay": 1394,
  "80000": 1395,
  "96700": 1396,
  "values": 1397,
  "88200": 1398,
  "TxnTm": 1399,
  "17200": 1400,
  "1590": 1401,
  "376": 1402,
  "AKAN": 1403,
  "allocated": 1404,
  "7500": 1405,
  "ValMeth": 1406,
  "55": 1407,
  "SYMBOL": 1408,
  "***": 1409,
  "ExDestination": 1410,
  "$117.74": 1411,
  "532": 1412,
  "why": 1413,
  "256": 1414,
  "CrdRtg": 1415,
  "FIXT.1.1": 1416,
  "427": 1417,
  "36800": 1418,
  "Polaris": 1419,
  "trader": 1420,
  "account)": 1421,
  "18700": 1422,
  "CXW": 1423,
  "82": 1424,
  "81": 1425,
  "4900": 1426,
  "3400": 1427,
  "(EncodedUnderlyingSecurityDe": 1428,
  "sc)": 1429,
  "represented": 1430,
  "prior": 1431,
  "define": 1432,
  "peg.": 1433,
  "Tile": 1434,
  "EXDESTINATION": 1435,
  "49": 1436,
  "1597": 1437,
  "99600": 1438,
  "Bankshares": 1439,
  "80900": 1440,
  "Grifols,": 1441,
  "991": 1442,
  "Endi": 1443,
  "972": 1444,
  "SecurityXML": 1445,
  "6200": 1446,
  "19200": 1447,
  "Realty": 1448,
  "(ComplexEventPriceBoundary": 1449,
  "Method)": 1450,
  "27700": 1451,
  "14400": 1452,
  "96100": 1453,
  "minimum": 1454,
  "20300": 1455,
  "All": 1456,
  "what": 1457,
  "OptAt": 1458,
  "43000": 1459,
  "1113": 1460,
  "24900": 1461,
  "25300": 1462,
  "Commission": 1463,
  "Bioscience": 1464,
  "1338": 1465,
  "pe)": 1466,
  "KLKLF": 1467,
  "79800": 1468,
  "3600": 1469,
  "Snrty": 1470,
  "Digitaltown": 1471,
  "35200": 1472,
  "Jodeur": 1473,
  "39900": 1474,
  "5300": 1475,
  "63000": 1476,
  "43": 1477,
  "possible": 1478,
  "(New)": 1479,
  "No": 1480,
  "Returned": 1481,
  "HUF/XOF": 1482,
  "preserve": 1483,
  "(Correspondent)": 1484,
  "98100": 1485,
  "57300": 1486,
  "Integrated": 1487,
  "86800": 1488,
  "Carlisle": 1489,
  "Companies": 1490,
  "(UnderlyingLegMaturit)": 1491,
  "54400": 1492,
  "355": 1493,
  "ENCODEDTEXT": 1494,
  "MessageEncoding": 1495,
  "field.": 1496,
  "Ltcaud": 1497,
  "95400": 1498,
  "66100": 1499,
  "1398": 1500,
  "(EncodedMktSegmDes)": 1501,
  "EncodedMktSegmDesc": 1502,
  "11100": 1503,
  "1404": 1504,
  "44300": 1505,
  "37000": 1506,
  "1397": 1507,
  "1294": 1508,
  "PartyIDSource(447)": 1509,
  "83000": 1510,
  "18500": 1511,
  "instruction": 1512,
  "custom": 1513,
  "1074": 1514,
  "curve.": 1515,
  "Ultra": 1516,
  "13500": 1517,
  "N.V.": 1518,
  "1281": 1519,
  "8300": 1520,
  "20700": 1521,
  "388": 1522,
  "1561": 1523,
  "warning": 1524,
  "Nme": 1525,
  "of)": 1526,
  "34": 1527,
  "I0Coin": 1528,
  "54300": 1529,
  "35100": 1530,
  "1133": 1531,
  "(EncodedUnderlyingSe": 1532,
  "849": 1533,
  "Bancshares": 1534,
  "5900": 1535,
  "81200": 1536,
  "stipulation.": 1537,
  "(NoRelatedContextPart)": 1538,
  "Shares": 1539,
  "1228": 1540,
  "plex)": 1541,
  "1221": 1542,
  "1337": 1543,
  "SecurityType(167)": 1544,
  "SecType": 1545,
  "Solgbp": 1546,
  "quotes": 1547,
  "Fresnillo": 1548,
  "94600": 1549,
  "Cannabis": 1550,
  "600": 1551,
  "878": 1552,
  "95700": 1553,
  "21400": 1554,
  "$119.62": 1555,
  "46100": 1556,
  "son)": 1557,
  "description": 1558,
  "issued.": 1559,
  "instrument.": 1560,
  "types": 1561,
  "Labs": 1562,
  "Confirmation": 1563,
  "10300": 1564,
  "99400": 1565,
  "Vision": 1566,
  "625": 1567,
  "sub": 1568,
  "37500": 1569,
  "99700": 1570,
  "SettlInstSource's": 1571,
  "local": 1572,
  "61100": 1573,
  "Pharmaroth": 1574,
  "83500": 1575,
  "94100": 1576,
  "767": 1577,
  "DiscretionOffset": 1578,
  "to.": 1579,
  "41400": 1580,
  "94300": 1581,
  "(used": 1582,
  "CapPx": 1583,
  "69800": 1584,
  "Earth": 1585,
  "Life": 1586,
  "1589": 1587,
  "(RelationshipRiskSymb)": 1588,
  "14300": 1589,
  "10900": 1590,
  "program": 1591,
  "594": 1592,
  "IOIID": 1593,
  "1334": 1594,
  "(Market": 1595,
  "Adabnb": 1596,
  "84600": 1597,
  "85200": 1598,
  "389": 1599,
  "66": 1600,
  "848": 1601,
  "82000": 1602,
  "88000": 1603,
  "Steel": 1604,
  "37400": 1605,
  "1255": 1606,
  "SettlTyp": 1607,
  "97200": 1608,
  "67300": 1609,
  "1335": 1610,
  "Indicator": 1611,
  "StrkCcy": 1612,
  "Jpybrl": 1613,
  "MatDt": 1614,
  "99900": 1615,
  "Gulfslope": 1616,
  "Central": 1617,
  "Upper": 1618,
  "48700": 1619,
  "90500": 1620,
  "28100": 1621,
  "Maximum": 1622,
  "14200": 1623,
  "Sun": 1624,
  "month": 1625,
  "year": 1626,
  "EndMMY": 1627,
  "6300": 1628,
  "validate": 1629,
  "Schema": 1630,
  "BY": 1631,
  "Scope": 1632,
  "depth": 1633,
  "881": 1634,
  "CLEARING": 1635,
  "11200": 1636,
  "75700": 1637,
  "include": 1638,
  "broker,": 1639,
  "fund": 1640,
  "1300": 1641,
  "expiration": 1642,
  "(always": 1643,
  "Discovery": 1644,
  "70100": 1645,
  "British": 1646,
  "Tobacco": 1647,
  "Coin": 1648,
  "53300": 1649,
  "Bristol-Myers": 1650,
  "Squibb": 1651,
  "Ce": 1652,
  "(RelationshipRiskEnco)": 1653,
  "313": 1654,
  "ar)": 1655,
  "(RelatedContextPartyI)": 1656,
  "Mitsubishi": 1657,
  "84300": 1658,
  "92200": 1659,
  "565": 1660,
  "40900": 1661,
  "1613": 1662,
  "74": 1663,
  "17100": 1664,
  "58200": 1665,
  "secondary": 1666,
  "499": 1667,
  "207": 1668,
  "81800": 1669,
  "Usdhkd": 1670,
  "1577": 1671,
  "Jpyils": 1672,
  "1602": 1673,
  "52200": 1674,
  "41800": 1675,
  "18": 1676,
  "Baosheng": 1677,
  "57800": 1678,
  "678": 1679,
  "Benchmark": 1680,
  "Curve.": 1681,
  "79": 1682,
  "Token,": 1683,
  "Center": 1684,
  "77200": 1685,
  "Minimum": 1686,
  "size": 1687,
  "42600": 1688,
  "SETTLING": 1689,
  "link": 1690,
  "LinkID": 1691,
  "1585": 1692,
  "Klondike": 1693,
  "PAHGF": 1694,
  "Multileg)": 1695,
  "26000": 1696,
  "TransTyp": 1697,
  "657": 1698,
  "oup": 1699,
  "12300": 1700,
  "47900": 1701,
  "Specific": 1702,
  "Golden": 1703,
  "59100": 1704,
  "Source)": 1705,
  "CFICode": 1706,
  "Nine": 1707,
  "677": 1708,
  "(RiskEncodedSecurity)": 1709,
  "Royalties": 1710,
  "18600": 1711,
  "MGRC": 1712,
  "Interactive": 1713,
  "1478": 1714,
  "(Cross)": 1715,
  "Outdoor": 1716,
  "BYRN": 1717,
  "1560": 1718,
  "Percent": 1719,
  "(5)": 1720,
  "36100": 1721,
  "1505": 1722,
  "Sonida": 1723,
  "CpnRt": 1724,
  "CALI": 1725,
  "77800": 1726,
  "Conquest": 1727,
  "Electronic": 1728,
  "Conduit": 1729,
  "European": 1730,
  "38700": 1731,
  "Automotive": 1732,
  "XML": 1733,
  "Action": 1734,
  "EncSecDescLen": 1735,
  "621": 1736,
  "94000": 1737,
  "Endeavors": 1738,
  "5100": 1739,
  "28400": 1740,
  "241": 1741,
  "719": 1742,
  "Value": 1743,
  "vs.": 1744,
  "334": 1745,
  "EUR/JOD": 1746,
  "1146": 1747,
  "1341": 1748,
  "SecurityAltIDSource(456)": 1749,
  "23800": 1750,
  "Berhad": 1751,
  "54800": 1752,
  "45900": 1753,
  "178": 1754,
  "miscellaneous": 1755,
  "1241": 1756,
  "78800": 1757,
  "59800": 1758,
  "Commonwealth": 1759,
  "Default": 1760,
  "32600": 1761,
  "Tsi": 1762,
  "Nl": 1763,
  "15700": 1764,
  "AvgPx": 1765,
  "EFP": 1766,
  "377": 1767,
  "469": 1768,
  "(Product)": 1769,
  "920": 1770,
  "1252": 1771,
  "53200": 1772,
  "480": 1773,
  "instance\"": 1774,
  "Nested": 1775,
  "tick": 1776,
  "25200": 1777,
  "(DerivativeSecurityAltI)": 1778,
  "9000": 1779,
  "CFICode.": 1780,
  "80400": 1781,
  "44900": 1782,
  "57500": 1783,
  "(Calculated": 1784,
  "MiscFees": 1785,
  "NetMoney))": 1786,
  "SymbolSfx.": 1787,
  "(ISO3)": 1788,
  "following": 1789,
  "245": 1790,
  "River": 1791,
  "536": 1792,
  "198": 1793,
  "1315": 1794,
  "different": 1795,
  "120": 1796,
  "COOK": 1797,
  "Desk": 1798,
  "Umc": 1799,
  "5200": 1800,
  "RptRefID": 1801,
  "44100": 1802,
  "issue": 1803,
  "(Asset)": 1804,
  "798": 1805,
  "36300": 1806,
  "1011": 1807,
  "80600": 1808,
  "Eagle": 1809,
  "264": 1810,
  "58": 1811,
  "TEXT": 1812,
  "32800": 1813,
  "new": 1814,
  "meaning": 1815,
  "buyside": 1816,
  "42000": 1817,
  "type.": 1818,
  "645": 1819,
  "42500": 1820,
  "1385": 1821,
  "EndDt": 1822,
  "Option": 1823,
  "50600": 1824,
  "367": 1825,
  "Volkswagen": 1826,
  "44500": 1827,
  "528": 1828,
  "ORDERCAPACITY": 1829,
  "Sierra": 1830,
  "SETTLEMENT": 1831,
  "TIMEINFORCE": 1832,
  "Absence": 1833,
  "does": 1834,
  "character": 1835,
  "entry.": 1836,
  "id": 1837,
  "1056": 1838,
  "currency,": 1839,
  "Xrausd": 1840,
  "Llc": 1841,
  "1St": 1842,
  "12200": 1843,
  "LIBOR": 1844,
  "10800": 1845,
  "Green": 1846,
  "S.A": 1847,
  "first": 1848,
  "30300": 1849,
  "Go": 1850,
  "29500": 1851,
  "(EncryptedNewPasswor)": 1852,
  "69900": 1853,
  "494": 1854,
  "3100": 1855,
  "1027": 1856,
  "instances.": 1857,
  "shares)": 1858,
  "23000": 1859,
  "19": 1860,
  "88900": 1861,
  "1058": 1862,
  "Diagnostics": 1863,
  "qualify": 1864,
  "SJM,": 1865,
  "apply": 1866,
  "22600": 1867,
  "intention": 1868,
  "CxlRplcRsn": 1869,
  "Encrypted": 1870,
  "password": 1871,
  "61300": 1872,
  "91800": 1873,
  "me)": 1874,
  "ORDTYPE": 1875,
  "65100": 1876,
  "Put": 1877,
  "Call": 1878,
  "Style": 1879,
  "\u201cN\u201d": 1880,
  "\u201cB\u201d": 1881,
  "852": 1882,
  "Dynamics": 1883,
  "Inspire": 1884,
  "Veterinary": 1885,
  "Partners": 1886,
  "40300": 1887,
  "Telcom": 1888,
  "74900": 1889,
  "(35)": 1890,
  "450": 1891,
  "end": 1892,
  "network": 1893,
  "Western": 1894,
  "14700": 1895,
  "value.": 1896,
  "79300": 1897,
  "Materials": 1898,
  "Iii": 1899,
  "Limited,": 1900,
  "27400": 1901,
  "MBS/TBA)": 1902,
  "settle.": 1903,
  "CSetMo": 1904,
  "26800": 1905,
  "(Home": 1906,
  "Digital": 1907,
  "55700": 1908,
  "106": 1909,
  "Cartesian": 1910,
  "firm)": 1911,
  "Equipment": 1912,
  "Shanrong": 1913,
  "Biotechnology": 1914,
  "InptSrc": 1915,
  "15400": 1916,
  "12800": 1917,
  "24500": 1918,
  "21800": 1919,
  "exercise": 1920,
  "device": 1921,
  "1062": 1922,
  "(NoUndlyInstrumentPa)": 1923,
  "InstrumentPartySubID": 1924,
  "(1053)": 1925,
  "Advanced": 1926,
  "price/rate": 1927,
  "instead": 1928,
  "Futures": 1929,
  "Options": 1930,
  "Gumi": 1931,
  "Retail": 1932
}