{
  "<|pad|>": 0,
  "<|bos|>": 1,
  "<|eos|>": 2,
  "<|fix|>": 3,
  "<|field|>": 4,
  "<|eom|>": 5,
  "<|unk|>": 6,
  "\n": 7,
  " ": 8,
  "!": 9,
  "\"": 10,
  "#": 11,
  "$": 12,
  "&": 13,
  "'": 14,
  "(": 15,
  ")": 16,
  "*": 17,
  "+": 18,
  ",": 19,
  "-": 20,
  ".": 21,
  "/": 22,
  "0": 23,
  "1": 24,
  "2": 25,
  "3": 26,
  "4": 27,
  "5": 28,
  "6": 29,
  "7": 30,
  "8": 31,
  "9": 32,
  ":": 33,
  ";": 34,
  "<": 35,
  "=": 36,
  ">": 37,
  "?": 38,
  "A": 39,
  "B": 40,
  "C": 41,
  "D": 42,
  "E": 43,
  "F": 44,
  "G": 45,
  "H": 46,
  "I": 47,
  "J": 48,
  "K": 49,
  "L": 50,
  "M": 51,
  "N": 52,
  "O": 53,
  "P": 54,
  "Q": 55,
  "R": 56,
  "S": 57,
  "T": 58,
  "U": 59,
  "V": 60,
  "W": 61,
  "X": 62,
  "Y": 63,
  "Z": 64,
  "[": 65,
  "]": 66,
  "_": 67,
  "a": 68,
  "b": 69,
  "c": 70,
  "d": 71,
  "e": 72,
  "f": 73,
  "g": 74,
  "h": 75,
  "i": 76,
  "j": 77,
  "k": 78,
  "l": 79,
  "m": 80,
  "n": 81,
  "o": 82,
  "p": 83,
  "q": 84,
  "r": 85,
  "s": 86,
  "t": 87,
  "u": 88,
  "v": 89,
  "w": 90,
  "x": 91,
  "y": 92,
  "z": 93,
  "|": 94,
  "\u00b6": 95,
  "\u00e1": 96,
  "\u00e8": 97,
  "\u00fc": 98,
  "\u2013": 99,
  "\u2014": 100,
  "\u2019": 101,
  "\u201c": 102,
  "\u201d": 103,
  "8=FIX": 104,
  "8=": 105,
  "9=": 106,
  "35=": 107,
  "49=": 108,
  "56=": 109,
  "34=": 110,
  "52=": 111,
  "11=": 112,
  "21=": 113,
  "55=": 114,
  "54=": 115,
  "38=": 116,
  "40=": 117,
  "44=": 118,
  "59=": 119,
  "150=": 120,
  "151=": 121,
  "14=": 122,
  "6=": 123,
  "10=": 124,
  "37=": 125,
  "17=": 126,
  "39=": 127,
  "60=": 128,
  "41=": 129,
  "1=": 130,
  "15=": 131,
  "48=": 132,
  "22=": 133,
  "31=": 134,
  "32=": 135,
  "58=": 136,
  "98=": 137,
  "108=": 138,
  "262=": 139,
  "263=": 140,
  "264=": 141,
  "269=": 142,
  "270=": 143,
  "271=": 144,
  "1128=": 145,
  "1137=": 146,
  "553=": 147,
  "554=": 148,
  "[FIX-4.4]": 149,
  "for": 150,
  "to": 151,
  "of": 152,
  "shares": 153,
  "order": 154,
  "buy": 155,
  "Tag": 156,
  "sell": 157,
  "at": 158,
  "market": 159,
  "limit": 160,
  "price": 161,
  "want": 162,
  "quantity": 163,
  "<!ELEMENT": 164,
  "FIX": 165,
  "with": 166,
  "session": 167,
  "Connect": 168,
  "30": 169,
  "heartbeat": 170,
  "seconds": 171,
  "Cancel": 172,
  "my": 173,
  "data": 174,
  "Create": 175,
  "Subscribe": 176,
  "Place": 177,
  "order:": 178,
  "(#PCDATA)>": 179,
  "Inc.": 180,
  "[Optional]": 181,
  "Buy": 182,
  "Sell": 183,
  "the": 184,
  "STRING": 185,
  "stock": 186,
  "place": 187,
  "trade": 188,
  "<!ATTLIST": 189,
  "short": 190,
  "me": 191,
  "get": 192,
  "purchase": 193,
  "Ltd.": 194,
  "EMPTY>": 195,
  "used": 196,
  "in": 197,
  "Corp.": 198,
  "[Required]": 199,
  "Corporation": 200,
  "Holdings": 201,
  "Group": 202,
  "as": 203,
  "FIXTag": 204,
  "not": 205,
  "Energy": 206,
  "CHAR": 207,
  "The": 208,
  "message": 209,
  "No": 210,
  "longer": 211,
  "FIXML": 212,
  "Limited": 213,
  "NUMINGR": 214,
  "Included": 215,
  "here": 216,
  "or": 217,
  "by": 218,
  "na": 219,
  "DTD": 220,
  "PRICE": 221,
  "security\u2019s": 222,
  "International": 223,
  "is": 224,
  "this": 225,
  "Number": 226,
  "be": 227,
  "Acquisition": 228,
  "Resources": 229,
  "Technologies": 230,
  "(n/a)": 231,
  "Indicates": 232,
  "identifier": 233,
  "Global": 234,
  "if": 235,
  "number": 236,
  "(replaced))": 237,
  "LOCALMKT": 238,
  "value": 239,
  "CDATA": 240,
  "#FIXED": 241,
  "Gold": 242,
  "which": 243,
  "and": 244,
  "Co.,": 245,
  "QTY": 246,
  "EUR": 247,
  "Corp": 248,
  "Deleted:": 249,
  "Unique": 250,
  "Inverted": 251,
  "Plc": 252,
  "individual": 253,
  "Identifies": 254,
  "1,000,000": 255,
  "Normal": 256,
  "50,000,000": 257,
  "See": 258,
  "(#PCDATA)>\u00b6": 259,
  "Mining": 260,
  "Technology": 261,
  "on": 262,
  "USD": 263,
  "4.4.": 264,
  "BOOLEAN": 265,
  "Request": 266,
  "Metals": 267,
  "Multileg": 268,
  "type": 269,
  "Minerals": 270,
  "Company": 271,
  "Capital": 272,
  "CURRENCY": 273,
  "For": 274,
  "instrument's": 275,
  "New": 276,
  "Underlying": 277,
  "Bancorp": 278,
  "repeating": 279,
  "AMT": 280,
  "Used": 281,
  "that": 282,
  "(non-ASCII": 283,
  "characters)": 284,
  "Therapeutics": 285,
  "Solutions": 286,
  "GBP": 287,
  "DATA": 288,
  "UTCTIME": 289,
  "4.3.": 290,
  "Indentification": 291,
  "China": 292,
  "(Deprecated))": 293,
  "order.": 294,
  "an": 295,
  "Financial": 296,
  "identify": 297,
  "underlying": 298,
  "Holding": 299,
  "F/X": 300,
  "First": 301,
  "\u201cCommon": 302,
  "PartyRole": 303,
  "Firms\u201d": 304,
  "prior": 305,
  "date": 306,
  "Inc.,": 307,
  "Pharmaceuticals": 308,
  "request": 309,
  "Currency": 310,
  "Industries": 311,
  "15800": 312,
  "LENGTH": 313,
  "Medical": 314,
  "within": 315,
  "Co": 316,
  "entries": 317,
  "Market": 318,
  "Time": 319,
  "rejected": 320,
  "Bank": 321,
  "whether": 322,
  "being": 323,
  "Mandatory": 324,
  "And": 325,
  "Price": 326,
  "has": 327,
  "leg": 328,
  "ORDER": 329,
  "One": 330,
  "De": 331,
  "Quantity": 332,
  "specific": 333,
  "Investment": 334,
  "Collateral": 335,
  "position": 336,
  "(e.g.": 337,
  "PRICEOFFSE": 338,
  "Reference": 339,
  "Life": 340,
  "Sciences": 341,
  "Ltd": 342,
  "FIRM": 343,
  "assigned": 344,
  "trading": 345,
  "(Receive)": 346,
  "ID": 347,
  "Co.": 348,
  "Registration": 349,
  "message.": 350,
  "Specifies": 351,
  "Order": 352,
  "Data": 353,
  "been": 354,
  "Instructions": 355,
  "Green": 356,
  "American": 357,
  "reference": 358,
  "code": 359,
  "settlement": 360,
  "10000": 361,
  "Quote": 362,
  "Entertainment": 363,
  "Message": 364,
  "Oil": 365,
  "United": 366,
  "Encoded": 367,
  "representation": 368,
  "Healthcare": 369,
  "Security": 370,
  "Nippon": 371,
  "CHF": 372,
  "entries.": 373,
  "Ag": 374,
  "security": 375,
  "Offer": 376,
  "Reason": 377,
  "S.A.": 378,
  "34300": 379,
  "Receive": 380,
  "27500": 381,
  "currency": 382,
  "36700": 383,
  "100": 384,
  "If": 385,
  "PERCENTAG": 386,
  "Gas": 387,
  "Lithium": 388,
  "part": 389,
  "[n/a": 390,
  "Ab": 391,
  "N/A": 392,
  "Assigned": 393,
  "party": 394,
  "Systems": 395,
  "Fixed": 396,
  "group": 397,
  "DataType": 398,
  "Status": 399,
  "5000": 400,
  "S.A.B.": 401,
  "(Execution)": 402,
  "(formerly": 403,
  "Identifier": 404,
  "Session": 405,
  "trade.": 406,
  "81000": 407,
  "25000": 408,
  "Name": 409,
  "58500": 410,
  "62900": 411,
  "Home": 412,
  "20000": 413,
  "Network": 414,
  "Brands": 415,
  "received": 416,
  "2003": 417,
  "61000": 418,
  "12500": 419,
  "Power": 420,
  "Smart": 421,
  "Specific": 422,
  "Required": 423,
  "Reset": 424,
  "a.": 425,
  "7300": 426,
  "Byte": 427,
  "length": 428,
  "encoded": 429,
  "61600": 430,
  "15": 431,
  "42200": 432,
  "future": 433,
  "Volume": 434,
  "Pacific": 435,
  "INT": 436,
  "source": 437,
  "(Status)": 438,
  "Ventures": 439,
  "1300": 440,
  "Bid": 441,
  "leg.": 442,
  "World": 443,
  "29000": 444,
  "specified": 445,
  "Biosciences": 446,
  "should": 447,
  "status": 448,
  "Media": 449,
  "MULTIPLEV": 450,
  "list": 451,
  "28300": 452,
  "68400": 453,
  "Products": 454,
  "SEQNUM": 455,
  "72200": 456,
  "allocation": 457,
  "previous": 458,
  "86300": 459,
  "58600": 460,
  "field": 461,
  "orders": 462,
  "Digital": 463,
  "67200": 464,
  "Exploration": 465,
  "14000": 466,
  "Health": 467,
  "Sa": 468,
  "transaction": 469,
  "Code": 470,
  "96900": 471,
  "Response": 472,
  "64700": 473,
  "21": 474,
  "Se": 475,
  "59000": 476,
  "broker": 477,
  "Biopharma": 478,
  "Logon": 479,
  "92600": 480,
  "Companies": 481,
  "Value": 482,
  "amount": 483,
  "49600": 484,
  "25400": 485,
  "Therapeutics,": 486,
  "200": 487,
  "(i.e.": 488,
  "2800": 489,
  "S.A": 490,
  "forward": 491,
  "points": 492,
  "added": 493,
  "48500": 494,
  "94500": 495,
  "was": 496,
  "51100": 497,
  "3400": 498,
  "42800": 499,
  "Class": 500,
  "messages": 501,
  "(Cancel)": 502,
  "REJECT": 503,
  "block": 504,
  "interest": 505,
  "identifying": 506,
  "39300": 507,
  "returned": 508,
  "firm": 509,
  "Aktiengesellschaft": 510,
  "collateral": 511,
  "Tech": 512,
  "27800": 513,
  "are": 514,
  "9800": 515,
  "51200": 516,
  "20": 517,
  "e.g.": 518,
  "99900": 519,
  "Trade": 520,
  "38200": 521,
  "10": 522,
  "name": 523,
  "Vision": 524,
  "S.P.A": 525,
  "63700": 526,
  "security.": 527,
  "22000": 528,
  "65900": 529,
  "63200": 530,
  "from": 531,
  "MsgSeqNum": 532,
  "Innovation": 533,
  "85400": 534,
  "78700": 535,
  "51300": 536,
  "swap": 537,
  "10800": 538,
  "when": 539,
  "90300": 540,
  "6600": 541,
  "50000": 542,
  "N.V": 543,
  "39900": 544,
  "46000": 545,
  "Investments": 546,
  "yield": 547,
  "23600": 548,
  "93500": 549,
  "Settlement": 550,
  "10700": 551,
  "Holdings,": 552,
  "300": 553,
  "REQUEST": 554,
  "555": 555,
  "Labs": 556,
  "44900": 557,
  "24700": 558,
  "Development": 559,
  "Foods": 560,
  "8400": 561,
  "21300": 562,
  "group.": 563,
  "Group,": 564,
  "PartySubID": 565,
  "Amount": 566,
  "execution": 567,
  "Bio": 568,
  "33700": 569,
  "72800": 570,
  "27300": 571,
  "11": 572,
  "Pending": 573,
  "8000": 574,
  "22500": 575,
  "Ag,": 576,
  "Integrated": 577,
  "last": 578,
  "57000": 579,
  "29500": 580,
  "94700": 581,
  "Finance": 582,
  "79500": 583,
  "24400": 584,
  "CIV": 585,
  "28600": 586,
  "6800": 587,
  "GT": 588,
  "first": 589,
  "50800": 590,
  "10200": 591,
  "benchmark": 592,
  "Treasury": 593,
  "18,": 594,
  "4.4": 595,
  "Errata": 596,
  "20030618-": 597,
  "specified.": 598,
  "57200": 599,
  "Trading": 600,
  "61400": 601,
  "84200": 602,
  "Of": 603,
  "56400": 604,
  "all": 605,
  "Request.": 606,
  "27900": 607,
  "30200": 608,
  "49000": 609,
  "12000": 610,
  "sequence": 611,
  "Corporation,": 612,
  "90100": 613,
  "53300": 614,
  "C.V": 615,
  "51500": 616,
  "details": 617,
  "78900": 618,
  "GBP/USD": 619,
  "1.6368": 620,
  "USD/GBP": 621,
  "0.610948192": 622,
  "EUR/USD": 623,
  "1.001": 624,
  "USD/EUR": 625,
  "0.999000999": 626,
  "EUR/GBP": 627,
  ".6111": 628,
  "GBP/EUR": 629,
  "1.636393389": 630,
  "EUR/CHF": 631,
  "1.6125": 632,
  "CHF/EUR": 633,
  "0.620155039": 634,
  "77300": 635,
  "Management": 636,
  "Limited,": 637,
  "EXCHANGE": 638,
  "quote": 639,
  "91700": 640,
  "64000": 641,
  "75900": 642,
  "12700": 643,
  "47200": 644,
  "41600": 645,
  "52300": 646,
  "15100": 647,
  "13500": 648,
  "identifies": 649,
  "29700": 650,
  "16200": 651,
  "12200": 652,
  "(always": 653,
  "expressed": 654,
  "529": 655,
  "spot": 656,
  "rate.": 657,
  "address": 658,
  "details,": 659,
  "Growth": 660,
  "47800": 661,
  "89000": 662,
  "Assignment": 663,
  "44100": 664,
  "37000": 665,
  "80200": 666,
  "12100": 667,
  "88900": 668,
  "7200": 669,
  "37100": 670,
  "23200": 671,
  "Common": 672,
  "(No": 673,
  "78500": 674,
  "95600": 675,
  "Rejected": 676,
  "reason": 677,
  "component": 678,
  "65200": 679,
  "26800": 680,
  "Diagnostics": 681,
  "56000": 682,
  "761": 683,
  "17400": 684,
  "83400": 685,
  "DATE": 686,
  "sub": 687,
  "185": 688,
  "Total": 689,
  "Income": 690,
  "69800": 691,
  "885": 692,
  "(not": 693,
  "<Instrument>)": 694,
  "currently": 695,
  "attributed": 696,
  "83700": 697,
  "Accept": 698,
  "77": 699,
  "level": 700,
  "4400": 701,
  "180": 702,
  "Resource": 703,
  "34800": 704,
  "price/rate": 705,
  "Ltd.,": 706,
  "Resend": 707,
  "requested": 708,
  "Resources,": 709,
  "applicable": 710,
  "78200": 711,
  "Report": 712,
  "70800": 713,
  "16700": 714,
  "21600": 715,
  "40400": 716,
  "Wellness": 717,
  "Sequence": 718,
  "91000": 719,
  "26200": 720,
  "handling": 721,
  "Ii": 722,
  "Property": 723,
  "FIX.4.4.": 724,
  "74800": 725,
  "6100": 726,
  "16500": 727,
  "88300": 728,
  "68100": 729,
  "3800": 730,
  "17": 731,
  "97700": 732,
  "32000": 733,
  "28700": 734,
  "Can": 735,
  "73200": 736,
  "83100": 737,
  "stipulation.": 738,
  "16": 739,
  "(X)": 740,
  "Enterprises": 741,
  "instances.": 742,
  "multileg": 743,
  "instrument": 744,
  "text": 745,
  "24100": 746,
  "62100": 747,
  "7500": 748,
  "60200": 749,
  "8800": 750,
  "trades": 751,
  "50200": 752,
  "Packaging": 753,
  "Asa": 754,
  "65000": 755,
  "56200": 756,
  "23500": 757,
  "Homes": 758,
  "68800": 759,
  "Position": 760,
  "84800": 761,
  "89700": 762,
  "27100": 763,
  "Premier": 764,
  "60700": 765,
  "66000": 766,
  "80000": 767,
  "one": 768,
  "side": 769,
  "10100": 770,
  "Pure": 771,
  "77400": 772,
  "AllocIntAtMat": 773,
  "17600": 774,
  "payment": 775,
  "Company,": 776,
  "4200": 777,
  "FullName": 778,
  "ComponentType": 779,
  "'Field'": 780,
  "58800": 781,
  "Labor": 782,
  "National": 783,
  "Partially": 784,
  "1600": 785,
  "Star": 786,
  "79700": 787,
  "12400": 788,
  "66500": 789,
  "74600": 790,
  "29400": 791,
  "81300": 792,
  "82400": 793,
  "72900": 794,
  "41800": 795,
  "57500": 796,
  "56100": 797,
  "67900": 798,
  "33200": 799,
  "Shipping": 800,
  "Leg": 801,
  "Benchmark": 802,
  "45800": 803,
  "74900": 804,
  "54100": 805,
  "17800": 806,
  "79100": 807,
  "49300": 808,
  "44800": 809,
  "54200": 810,
  "83000": 811,
  "77200": 812,
  "account": 813,
  "days": 814,
  "following": 815,
  "day": 816,
  "528": 817,
  "indicate": 818,
  "60800": 819,
  "15500": 820,
  "53": 821,
  "38100": 822,
  "34500": 823,
  "78000": 824,
  "JUNE": 825,
  "6300": 826,
  "53400": 827,
  "required": 828,
  "99": 829,
  "named:": 830,
  "4.3))": 831,
  "5900": 832,
  "Quest": 833,
  "49900": 834,
  "Password": 835,
  "84700": 836,
  "31700": 837,
  "700": 838,
  "19300": 839,
  "Standard": 840,
  "68600": 841,
  "80500": 842,
  "9000": 843,
  "16900": 844,
  "Token": 845,
  "named": 846,
  "4.4))": 847,
  "16600": 848,
  "80300": 849,
  "Reject": 850,
  "34900": 851,
  "47000": 852,
  "16100": 853,
  "time": 854,
  "38700": 855,
  "73300": 856,
  "issue": 857,
  "55500": 858,
  "59500": 859,
  "57100": 860,
  "75500": 861,
  "31300": 862,
  "32600": 863,
  "Income,": 864,
  "23700": 865,
  "19200": 866,
  "5400": 867,
  "2000": 868,
  "request.": 869,
  "Source": 870,
  "2700": 871,
  "77100": 872,
  "70400": 873,
  "High": 874,
  "Type": 875,
  "(Clearing)": 876,
  "60100": 877,
  "42000": 878,
  "95400": 879,
  "Precision": 880,
  "60400": 881,
  "Copper": 882,
  "39700": 883,
  "66900": 884,
  "178": 885,
  "(no": 886,
  "used))": 887,
  "new": 888,
  "per": 889,
  "96400": 890,
  "45100": 891,
  "1500": 892,
  "22600": 893,
  "33500": 894,
  "31000": 895,
  "56300": 896,
  "Mountain": 897,
  "DiscretionOffset": 898,
  "2200": 899,
  "25900": 900,
  "7100": 901,
  "Quantum": 902,
  "88400": 903,
  "1800": 904,
  "23400": 905,
  "3300": 906,
  "Pinnacle": 907,
  "Sabio": 908,
  "NOLEGS": 909,
  "Instruction": 910,
  "represented": 911,
  "Side": 912,
  "associated": 913,
  "e)": 914,
  "62000": 915,
  "40200": 916,
  "Free": 917,
  "format": 918,
  "securities": 919,
  "80100": 920,
  "1200": 921,
  "Canada": 922,
  "80700": 923,
  "COUNTRY": 924,
  "Services": 925,
  "30900": 926,
  "Spread": 927,
  "71500": 928,
  "96700": 929,
  "Definition": 930,
  "stipulation": 931,
  "86700": 932,
  "Equity": 933,
  "Partners": 934,
  "187": 935,
  "(CashSettlAgentContac": 936,
  "12900": 937,
  "800": 938,
  "SDValue": 939,
  "449": 940,
  "PartyID": 941,
  "92500": 942,
  "MOOOD": 943,
  "67400": 944,
  "90400": 945,
  "771": 946,
  "Strike": 947,
  "70600": 948,
  "106": 949,
  "Business": 950,
  "84900": 951,
  "May": 952,
  "Set": 953,
  "possibly": 954,
  "MailingDtls": 955,
  "100000": 956,
  "921": 957,
  "Starting": 958,
  "cash": 959,
  "consideration": 960,
  "Etctry": 961,
  "26": 962,
  "40800": 963,
  "25200": 964,
  "948": 965,
  "s)": 966,
  "NUMING": 967,
  "86100": 968,
  "43900": 969,
  "Food": 970,
  "From": 971,
  "Smith": 972,
  "440": 973,
  "350": 974,
  "54800": 975,
  "Microstrategy": 976,
  "63400": 977,
  "14900": 978,
  "92800": 979,
  "Pet": 980,
  "Stock": 981,
  "43500": 982,
  "46": 983,
  "RefSeqNum": 984,
  "21200": 985,
  "13": 986,
  "send": 987,
  "62700": 988,
  "16300": 989,
  "reject": 990,
  "VALUE": 991,
  "intended": 992,
  "SettlParties": 993,
  "(note": 994,
  "exchange": 995,
  "Antiaging": 996,
  "26100": 997,
  "73700": 998,
  "19": 999,
  "Nbt": 1000,
  "85900": 1001,
  "OXT/EUR": 1002,
  "Reports": 1003,
  "25500": 1004,
  "Clean": 1005,
  "42600": 1006,
  "307": 1007,
  "OpenCloseSettlFlag": 1008,
  "27700": 1009,
  "35100": 1010,
  "Energy,": 1011,
  "54300": 1012,
  "70700": 1013,
  "Corp.,": 1014,
  "69300": 1015,
  "<UnderlyingInstrument>": 1016,
  "660": 1017,
  "97600": 1018,
  "Genesis": 1019,
  "57800": 1020,
  "45900": 1021,
  "Valid": 1022,
  "Heartbeat": 1023,
  "Rising": 1024,
  "93800": 1025,
  "AllocStatus": 1026,
  "reject)": 1027,
  "provided": 1028,
  "(SecuritySettlAgentCo)": 1029,
  "Headline": 1030,
  "Mid": 1031,
  "Shin-Etsu": 1032,
  "76900": 1033,
  "Qtumjpy": 1034,
  "2400": 1035,
  "Street": 1036,
  "RESEND": 1037,
  "1.": 1038,
  "BidPx": 1039,
  "38000": 1040,
  "General": 1041,
  "Insurance": 1042,
  "ACCOUNT": 1043,
  "14100": 1044,
  "25100": 1045,
  "Communications": 1046,
  "68300": 1047,
  "SEQUENCE": 1048,
  "fill": 1049,
  "Inc": 1050,
  "19600": 1051,
  "95500": 1052,
  "76200": 1053,
  "(AllowableOneSidedne)": 1054,
  "52900": 1055,
  "Full": 1056,
  "RegistDtls": 1057,
  "Midnight": 1058,
  "PartyIDSource": 1059,
  "39000": 1060,
  "59600": 1061,
  "352": 1062,
  "81800": 1063,
  "91800": 1064,
  "22400": 1065,
  "closing": 1066,
  "873": 1067,
  "Anglo": 1068,
  "Right": 1069,
  "14600": 1070,
  "LOGOUT": 1071,
  "Logout": 1072,
  "counterparty": 1073,
  "76300": 1074,
  "51800": 1075,
  "Longer": 1076,
  "Used))": 1077,
  "227": 1078,
  "11200": 1079,
  "46100": 1080,
  "99800": 1081,
  "use": 1082,
  "Commission": 1083,
  "4800": 1084,
  "Hong": 1085,
  "Kong": 1086,
  "Battery": 1087,
  "SEK/AED": 1088,
  "Avisa": 1089,
  "NEW": 1090,
  "(cid:198)": 1091,
  "Must": 1092,
  "used.": 1093,
  "Entry.": 1094,
  "30100": 1095,
  "WLTW": 1096,
  "set": 1097,
  "(Y)": 1098,
  "4600": 1099,
  "202": 1100,
  "85200": 1101,
  "Strategic": 1102,
  "17500": 1103,
  "Hang": 1104,
  "Method": 1105,
  "Standing": 1106,
  "StandInstDbName": 1107,
  "GELGF": 1108,
  "ARS/GBP": 1109,
  "calculated": 1110,
  "66100": 1111,
  "19900": 1112,
  "Income.": 1113,
  "68500": 1114,
  "52000": 1115,
  "LIBOR": 1116,
  "OrderID": 1117,
  "affected": 1118,
  "mass": 1119,
  "Holding,": 1120,
  "8300": 1121,
  "72300": 1122,
  "87400": 1123,
  "82600": 1124,
  "93900": 1125,
  "33100": 1126,
  "Fund": 1127,
  "41700": 1128,
  "qualify": 1129,
  "24300": 1130,
  "'String'": 1131,
  "((Not": 1132,
  "Defined))": 1133,
  "Recon": 1134,
  "66300": 1135,
  "Note": 1136,
  "29200": 1137,
  "Akwaaba": 1138,
  "Identification": 1139,
  "Castellum": 1140,
  "Maximum": 1141,
  "shares)": 1142,
  "646": 1143,
  "Berhad": 1144,
  "389": 1145,
  "via": 1146,
  "Productions": 1147,
  "block.": 1148,
  "PegDifference": 1149,
  "26400": 1150,
  "38300": 1151,
  "Razor": 1152,
  "Better": 1153,
  "500": 1154,
  "741": 1155,
  "maturity": 1156,
  "11500": 1157,
  "News": 1158,
  "79400": 1159,
  "Sack": 1160,
  "C.V.": 1161,
  "Natural": 1162,
  "S.A,": 1163,
  "6900": 1164,
  "132": 1165,
  "1400": 1166,
  "matching": 1167,
  "742": 1168,
  "AllocAcrdIntAmt": 1169,
  "'Amt'": 1170,
  "31": 1171,
  "Detwiler": 1172,
  "Fenton": 1173,
  "Farmers": 1174,
  "45200": 1175,
  "Critical": 1176,
  "PENDING": 1177,
  "7000": 1178,
  "Broker": 1179,
  "then": 1180,
  "Replace": 1181,
  "Olympia": 1182,
  "requesting": 1183,
  "Blue": 1184,
  "Marine": 1185,
  "Daily": 1186,
  "S.P.A.": 1187,
  "79800": 1188,
  "94600": 1189,
  "report": 1190,
  "PosMaintRptID": 1191,
  "6200": 1192,
  "Wind": 1193,
  "Wentworth": 1194,
  "27400": 1195,
  "Research": 1196,
  "Silver": 1197,
  "Mixed": 1198,
  "Martial": 1199,
  "Arts": 1200,
  "186": 1201,
  "response": 1202,
  "Disconnect": 1203,
  "without": 1204,
  "sending": 1205,
  "54600": 1206,
  "indicator": 1207,
  "40900": 1208,
  "61500": 1209,
  "booked": 1210,
  "92900": 1211,
  "Solar": 1212,
  "Envit": 1213,
  "62300": 1214,
  "42400": 1215,
  "Top": 1216,
  "49700": 1217,
  "day\u2019s": 1218,
  "canceled": 1219,
  "due": 1220,
  "532": 1221,
  "Mass": 1222,
  "Century": 1223,
  "34100": 1224,
  "Aero": 1225,
  "74500": 1226,
  "364": 1227,
  "370": 1228,
  "19700": 1229,
  "31900": 1230,
  "LocationID?)>": 1231,
  "71900": 1232,
  "99600": 1233,
  "ECSNF": 1234,
  "4900": 1235,
  "21100": 1236,
  "61100": 1237,
  "Curve.": 1238,
  "Cigna": 1239,
  "DKK/OMR": 1240,
  "Peso": 1241,
  "Cayman": 1242,
  "15200": 1243,
  "character": 1244,
  "20900": 1245,
  "21000": 1246,
  "Absence": 1247,
  "70900": 1248,
  "848": 1249,
  "4300": 1250,
  "56900": 1251,
  "LSBCF": 1252,
  "52700": 1253,
  "Merchants": 1254,
  "Denotes": 1255,
  "accepted": 1256,
  "network": 1257,
  "offer": 1258,
  "41500": 1259,
  "Dpm": 1260,
  "71800": 1261,
  "620": 1262,
  "Yfiinr": 1263,
  "860": 1264,
  "85700": 1265,
  "Oxford": 1266,
  "498": 1267,
  "FundRenewWaiv": 1268,
  "Prestige": 1269,
  "42900": 1270,
  "74300": 1271,
  "62400": 1272,
  "(NoRegistDtls)": 1273,
  "241": 1274,
  "51600": 1275,
  "Corporate": 1276,
  "238": 1277,
  "82000": 1278,
  "Athabasca": 1279,
  "Crawford": 1280,
  "9900": 1281,
  "14300": 1282,
  "192": 1283,
  "OrderQty": 1284,
  "(38)": 1285,
  "126": 1286,
  "Conditionally": 1287,
  "TimeInForce": 1288,
  "GTD": 1289,
  "363": 1290,
  "(EncodedUnderlyingIss)": 1291,
  "64900": 1292,
  "Shares": 1293,
  "This": 1294,
  "66": 1295,
  "Inquiry": 1296,
  "95300": 1297,
  "Ctpartners": 1298,
  "Executive": 1299,
  "Search": 1300,
  "BKCPF": 1301,
  "84500": 1302,
  "Tai": 1303,
  "48000": 1304,
  "14": 1305,
  "(EncodedLegSecurityD)": 1306,
  "Sentient": 1307,
  "32100": 1308,
  "North": 1309,
  "27000": 1310,
  "79600": 1311,
  "Virtual": 1312,
  "Interactive": 1313,
  "29900": 1314,
  "Data443": 1315,
  "Cnyxcd": 1316,
  "588": 1317,
  "55900": 1318,
  "230": 1319,
  "53900": 1320,
  "18500": 1321,
  "Land": 1322,
  "50400": 1323,
  "33000": 1324,
  "Contract": 1325,
  "57700": 1326,
  "286": 1327,
  "2100": 1328,
  "Healios": 1329,
  "K.K": 1330,
  "Lucid": 1331,
  "541": 1332,
  "4000": 1333,
  "97400": 1334,
  "28800": 1335,
  "Janus": 1336,
  "Electric": 1337,
  "50600": 1338,
  "(UnderlyingTradingSes)": 1339,
  "103": 1340,
  "47600": 1341,
  "California": 1342,
  "25800": 1343,
  "MDEntryBuyer": 1344,
  "Snail": 1345,
  "NoOrders": 1346,
  "same": 1347,
  "BUMTF": 1348,
  "Omni": 1349,
  "7600": 1350,
  "597": 1351,
  "18600": 1352,
  "19400": 1353,
  "nested": 1354,
  "64100": 1355,
  "session-level": 1356,
  "32800": 1357,
  "74200": 1358,
  "Ottawa": 1359,
  "231": 1360,
  "63800": 1361,
  "71200": 1362,
  "357": 1363,
  "Frontera": 1364,
  "Advanced": 1365,
  "37500": 1366,
  "84400": 1367,
  "28": 1368,
  "10600": 1369,
  "900": 1370,
  "33400": 1371,
  "5800": 1372,
  "674": 1373,
  "To": 1374,
  "'char'\u00b6": 1375,
  "Hotels": 1376,
  "95100": 1377,
  "30400": 1378,
  "referenced": 1379,
  "CollInquiryID": 1380,
  "25300": 1381,
  "POFCF": 1382,
  "SHIB/USD": 1383,
  "card": 1384,
  "CardHolderName": 1385,
  "83200": 1386,
  "Execution": 1387,
  "StopPx": 1388,
  "Alternate": 1389,
  "class": 1390,
  "Corazon": 1391,
  "69500": 1392,
  "Bitcoin": 1393,
  "curve.": 1394,
  "Nova": 1395,
  "Instrument": 1396,
  "7700": 1397,
  "strike": 1398,
  "81900": 1399,
  "International,": 1400,
  "Sumco": 1401,
  "QtyTypDeprecated": 1402,
  "CURRENTFACE": 1403,
  "ORIGINALFACE": 1404,
  "(2)": 1405,
  "Limit": 1406,
  "66600": 1407,
  "Incorporated": 1408,
  "46200": 1409,
  "82900": 1410,
  "48400": 1411,
  "represents": 1412,
  "39800": 1413,
  "23300": 1414,
  "76800": 1415,
  "96500": 1416,
  "volume": 1417,
  "75700": 1418,
  "48300": 1419,
  "Motorpoint": 1420,
  "36200": 1421,
  "81": 1422,
  "Processing": 1423,
  "UTK": 1424,
  "120": 1425,
  "Bravada": 1426,
  "84100": 1427,
  "HopCompID": 1428,
  "NoHops": 1429,
  "Automation": 1430,
  "8200": 1431,
  "Pharmaceuticals,": 1432,
  "location": 1433,
  "15400": 1434,
  "Trust": 1435,
  "88000": 1436,
  "901": 1437,
  "Datasea": 1438,
  "42500": 1439,
  "176": 1440,
  "24900": 1441,
  "Stubhub": 1442,
  "317": 1443,
  "SymbolSfx.": 1444,
  "miscellaneous": 1445,
  "fee": 1446,
  "MiscFeeAmt": 1447,
  "agreement": 1448,
  "Pharma": 1449,
  "Liberal": 1450,
  "NestedPartyID": 1451,
  "89900": 1452,
  "118": 1453,
  "NETMONEY": 1454,
  "Mines": 1455,
  "4700": 1456,
  "end": 1457,
  "Cable": 1458,
  "956": 1459,
  "BidID": 1460,
  "22Nd": 1461,
  "17100": 1462,
  "SecondaryOrderID": 1463,
  "94900": 1464,
  "$471.77": 1465,
  "NoDistribInsts": 1466,
  "711": 1467,
  "basis": 1468,
  "37200": 1469,
  "must": 1470,
  "69600": 1471,
  "back": 1472,
  "45700": 1473,
  "74700": 1474,
  "(Year)": 1475,
  "6700": 1476,
  "426": 1477,
  "Helium": 1478,
  "Travelzoo": 1479,
  "Frontier": 1480,
  "(CIV)": 1481,
  "EXAMPLE": 1482,
  "fund": 1483,
  "34200": 1484,
  "average": 1485,
  "15000": 1486,
  "Bitbbtc": 1487,
  "CMHZ": 1488,
  "83600": 1489,
  "MiscFees": 1490,
  "NetMoney))": 1491,
  "41900": 1492,
  "616": 1493,
  "218": 1494,
  "Public": 1495,
  "(Publ)": 1496,
  "81700": 1497,
  "63": 1498,
  "86900": 1499,
  "Water": 1500,
  "50700": 1501,
  "24200": 1502,
  "Phoenix": 1503,
  "8900": 1504,
  "Planet": 1505,
  "instance\"": 1506,
  "Nested": 1507,
  "POSITIONEFFECT": 1508,
  "Science": 1509,
  "88600": 1510,
  "15700": 1511,
  "SKSUF": 1512,
  "filled,": 1513,
  "45300": 1514,
  "10900": 1515,
  "21900": 1516,
  "Result": 1517,
  "31100": 1518,
  "15600": 1519,
  "4500": 1520,
  "broker,": 1521,
  "Sante": 1522,
  "77000": 1523,
  "11000": 1524,
  "424": 1525,
  "less": 1526,
  "ASSIGNED": 1527,
  "96200": 1528,
  "Campbell": 1529,
  "because": 1530,
  "38800": 1531,
  "can": 1532,
  "ODFL": 1533,
  "80400": 1534,
  "23000": 1535,
  "Noble": 1536,
  "Mineral": 1537,
  "i.e.": 1538,
  "RegistID": 1539,
  "94100": 1540,
  "36600": 1541,
  "Kiromic": 1542,
  "Education": 1543,
  "Car": 1544,
  "13900": 1545,
  "71300": 1546,
  "SettlSessID": 1547,
  "Investors": 1548,
  "Property,": 1549,
  "specifies": 1550,
  "93100": 1551,
  "Allied": 1552,
  "678": 1553,
  "82100": 1554,
  "related": 1555,
  "31600": 1556,
  "8500": 1557,
  "West": 1558,
  "zero": 1559,
  "Sa/Nv": 1560,
  "Banca": 1561,
  "86600": 1562,
  "Living": 1563,
  "20600": 1564,
  "220": 1565,
  "effective": 1566,
  "determined": 1567,
  "Internet": 1568,
  "47700": 1569,
  "97800": 1570,
  "ORDERCAPACITY": 1571,
  "30700": 1572,
  "20400": 1573,
  "range": 1574,
  "FIRST": 1575,
  "CFICode": 1576,
  "\u201cO\u201d": 1577,
  "247": 1578,
  "20800": 1579,
  "Lightspace": 1580,
  "80600": 1581,
  "823": 1582,
  "69900": 1583,
  "ISO": 1584,
  "Country": 1585,
  "third": 1586,
  "941": 1587,
  "RFQ": 1588,
  "1700": 1589,
  "3500": 1590,
  "43800": 1591,
  "81600": 1592,
  "Odfjell": 1593,
  "69700": 1594,
  "Suncast": 1595,
  "59300": 1596,
  "SRPT": 1597,
  "48900": 1598,
  "40000": 1599,
  "70100": 1600,
  "Care": 1601,
  "ame": 1602,
  "85600": 1603,
  "125": 1604,
  "250": 1605,
  "624": 1606,
  "99400": 1607,
  "610,948.19": 1608,
  "81,840,000.00": 1609,
  "999,001.00": 1610,
  "50,050,000.00": 1611,
  "611,100.00": 1612,
  "81,819,669.45": 1613,
  "1,612,500.00": 1614,
  "31,007,751.94": 1615,
  "77500": 1616,
  "18700": 1617,
  "83300": 1618,
  "Drgusd": 1619,
  "329": 1620,
  "26500": 1621,
  "22900": 1622,
  "18": 1623,
  "acceptor": 1624,
  "67800": 1625,
  "9700": 1626,
  "RYLPF": 1627,
  "75100": 1628,
  "13400": 1629,
  "99300": 1630,
  "76700": 1631,
  "32400": 1632,
  "Vault": 1633,
  "Coin": 1634,
  "Uranium": 1635,
  "Kwg": 1636,
  "12300": 1637,
  "NoBidComponents": 1638,
  "Verity": 1639,
  "4100": 1640,
  "77900": 1641,
  "Hknusd": 1642
}